#!/usr/bin/python
# -*- coding: utf-8 -*-
import tushare as ts
import requests
import pandas as pd
import sqlite3

import sys
# reload(sys)

# sys.setdefaultencoding('utf-8')

# st = ts.Market()
# st.Mkt
# df = st.MktEqud(tradeDate='20150917', field='ticker,secShortName')
# print df
# df['ticker'] = df['ticker'].map(lambda x: str(x).zfill(6))

# 取得基本信息

# df1 = ts.get_stock_basics()
# df1 = df1.loc[['002385','002657','002668','002139','002340','002652','002562','002262','002535','002707','002531','000426','002445','002293','002355'],['name','industry','area','pe','bvps','totalAssets']].sort(columns='pe')
#
# print df1
# df3 = ts.get_growth_data(2016,4)
# df3 = df3.set_index('code')
# df3 = df3.loc[['002385','002657','002668','002139','002340','002652','002562','002262','002535','002707','002531','000426','002445','002293','002355']]
# print df3
# df4 = pd.concat([df1,df3])
# df4.to_csv('333.csv')
# print df4
#
# df1 = ts.get_stock_basics()
# df1 = df1.loc[['603658','603228','601633','600816','600312','300516','300463','300026','300017','002833','002745','002701','002415','002294','002202'],['name','industry','area','pe','bvps','totalAssets']].sort(columns='pe')
# # df1.to_csv('111.csv')
#
# df3 = ts.get_growth_data(2017,1)
# df3 = df3.set_index('code')
# df3 = df3.loc[['603658','603228','601633','600816','600312','300516','300463','300026','300017','002833','002745','002701','002415','002294','002202']]
# print df3
# df3.to_csv('222.csv')

# df1 = ts.get_stock_basics()
# print df1
# df1 = df1.loc[['603658','603228','601633','600816','600312','300516','300463','300026','300017','002833','002745','002701','002415','002294','002202'],['name','industry','area','pe','bvps','totalAssets']]
# df1.to_csv("444.csv",encoding="gb2312")


# df1 = ts.forecast_data(2017,2)
# df1 = ts.get_report_data(2017,2)
df1 = ts.get_stock_basics()
list1 = ['新和成','伟星股份','华邦制药','华兰生物','大族激光','传化股份','科华生物','思源电气','达安基因','巨轮股份','宜科科技','登海种业','广州国光','轴研科技','宁波华翔','横店东磁','远光软件','江苏宏宝','软控股份','中材科技','金智科技','江苏国泰','青岛金王','浔兴股份','广东鸿图','广博股份','恒宝股份','信隆实业','莱宝高科','威海广泰','东港股份','康强电子','新海股份','科陆电子','荣信股份','湘潭电化','银轮股份','沃尔核材','利欧股份','顺络电子','拓邦股份','东华科技','蓉胜超微','宏达高科','西部材料','江苏通润','北斗星通','汉钟精机','常铝股份','远望谷','东力传动','精诚铜业','广陆数测','江特电机','中航光电','云海金属','怡亚通','新嘉联','成飞集成','方正电机','证通电子','九鼎新材','金风科技','海利得','达意隆','宏达新材','特尔佳','拓日新能','福晶科技','鱼跃医疗','三力士','濮耐股份','启明信息','九阳股份','通产丽星','北化股份','烟台氨纶','利尔化学','西仪股份','法因数控','水晶光电','博深工具','天润曲轴','亚太股份','中利科技','雅致股份','科华恒盛','赛象科技','新纶科技','禾欣股份','柘中建设','泰尔重工','高乐股份','鼎泰新材','联信永益','南洋科技','和而泰','爱仕达','四维图新','远东传动','多氟多','齐翔腾达','雅克科技','广联达','九九久','常发股份','高德红外','海康威视','毅昌股份','中原特钢','云南锗业','杭氧股份','兴森科技','江苏神通','金洲管道','巨星科技','中南重工','盛路通信','中原内配','国星光电','康得新','天马精化','松芝股份','百川股份','欧菲光','益生股份','天业通联','赣锋锂业','特锐德','南风股份','汉威电子','鼎汉技术','华测检测','亿纬锂能','爱尔眼科','北陆药业','网宿科技','中元华电','硅宝科技','吉峰农机','机器人','红日药业','华谊兄弟','阳普医疗','宝通带业','金龙机电','新宙邦','回天胶业','星辉车模','华力创通','台基股份','福瑞股份','欧比特','鼎龙股份','蓝色光标','东方财富','中能电气','天龙集团','海兰信','三川股份','安诺其','碧水源','三聚环保','当升科技','华平股份','数字政通','宁波GQY','国民技术','中瑞思创','新大新材','奥克股份','海默科技','银之杰','长城集团','金通灵','金刚玻璃','华伍股份','智云股份','尤洛卡','国腾电子','先河环保']
pd2 = df1[df1['name'].isin(list1)]

pd2.to_csv("555.csv",encoding="utf-8")
# print(pd2.loc[:,['name','pe']])
print("終わりました")

# df1 = df1.loc[['603658','603228','601633','600816','600312','300516','300463','300026','300017','002833','002745','002701','002415','002294','002202'],['name','industry','area','pe','bvps','totalAssets']]
# print(df1)
# print(df1.to_json(orient='index'))



